In [3]:
import pandas as pd

import numpy as np

import matplotlib.pyplot as plt

In [ ]:
- read_csv方法
  - train = pd.read_csv('./data/train.csv')#.代表当前文件夹
  - train是什么格式：
- df.fillna(' string')#用string代替缺失值

In [29]:
col=list('ABCD')#['A','B','C','D']
type(col)

list

In [28]:
col[1:2]

['B']

In [80]:
#通过传递一个numpy array，时间索引以及列标签来创建一个DataFrame：

dates = pd.date_range('20130101', periods=6)

dates

df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

df

                   A         B         C         D
2013-01-01 -0.420843 -0.910991  1.773794 -1.611971
2013-01-02 -0.103042  0.605576 -1.818530 -3.160988
2013-01-03 -1.227824  1.207903  0.556289 -0.409755
2013-01-04 -0.181330  0.592399 -0.175034 -0.067014
2013-01-05 -0.457267  0.543653 -1.209936 -1.610921
2013-01-06  0.737691  0.142966 -0.819111  0.353995

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
#查看DataFrame的数据类型
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [ ]:
# 二。查看数据

In [11]:
df.head(2)

                   A         B         C         D
2013-01-01  0.172828  0.169842 -0.139966 -0.753470
2013-01-02 -1.231252 -0.383122  1.404800 -0.440605

In [10]:
df.tail(3)

                   A         B         C         D
2013-01-02 -1.231252 -0.383122  1.404800 -0.440605
2013-01-03  1.307271  0.028474 -0.700076  0.581063
2013-01-04  0.285534 -0.006510  0.140231  0.444879
2013-01-05  0.651992  1.214307  0.299408 -0.607426
2013-01-06  1.104101 -0.032067 -0.880072 -1.396610

In [12]:
#2.显示索引，列和底层的numpy数据
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.values

array([[ 0.17282823,  0.16984211, -0.13996604, -0.75347009],
       [-1.23125164, -0.38312201,  1.40480033, -0.44060519],
       [ 1.30727139,  0.02847415, -0.7000759 ,  0.58106263],
       [ 0.28553432, -0.00651042,  0.14023126,  0.44487851],
       [ 0.65199179,  1.21430725,  0.29940827, -0.60742575],
       [ 1.10410073, -0.03206651, -0.88007201, -1.39660963]])

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.381746  0.165154  0.020721 -0.362028
std    0.906211  0.545600  0.820295  0.752396
min   -1.231252 -0.383122 -0.880072 -1.396610
25%    0.201005 -0.025677 -0.560048 -0.716959
50%    0.468763  0.010982  0.000133 -0.524015
75%    0.991073  0.134500  0.259614  0.223508
max    1.307271  1.214307  1.404800  0.581063

In [19]:
#按某一列排序
df.sort_values(by='B')

                   A         B         C         D
2013-01-02 -1.231252 -0.383122  1.404800 -0.440605
2013-01-06  1.104101 -0.032067 -0.880072 -1.396610
2013-01-04  0.285534 -0.006510  0.140231  0.444879
2013-01-03  1.307271  0.028474 -0.700076  0.581063
2013-01-01  0.172828  0.169842 -0.139966 -0.753470
2013-01-05  0.651992  1.214307  0.299408 -0.607426

In [ ]:
#三。选择
推荐使用经过优化的pandas数据访问方式： .at, .iat, .loc, .iloc 和 .ix

In [20]:
#获取
df.A

2013-01-01    0.172828
2013-01-02   -1.231252
2013-01-03    1.307271
2013-01-04    0.285534
2013-01-05    0.651992
2013-01-06    1.104101
Freq: D, Name: A, dtype: float64

In [40]:
#选择单独的列
df['A']

2013-01-01    0.172828
2013-01-02   -1.231252
2013-01-03    1.307271
2013-01-04    0.285534
2013-01-05    0.651992
2013-01-06    1.104101
Freq: D, Name: A, dtype: float64

In [30]:
#切片操作
df[0:3]#包括0，但是不包括3.

                   A         B         C         D
2013-01-01  0.172828  0.169842 -0.139966 -0.753470
2013-01-02 -1.231252 -0.383122  1.404800 -0.440605
2013-01-03  1.307271  0.028474 -0.700076  0.581063

In [31]:
#切片操作
df['2013-01-01':'2013-01-04']

                   A         B         C         D
2013-01-01  0.172828  0.169842 -0.139966 -0.753470
2013-01-02 -1.231252 -0.383122  1.404800 -0.440605
2013-01-03  1.307271  0.028474 -0.700076  0.581063
2013-01-04  0.285534 -0.006510  0.140231  0.444879

In [33]:
#使用标签来获取一个交叉的区域
df.loc[dates[0]]

A    0.172828
B    0.169842
C   -0.139966
D   -0.753470
Name: 2013-01-01 00:00:00, dtype: float64

In [38]:
#通过标签在多个列上进行选择
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.172828  0.169842
2013-01-02 -1.231252 -0.383122
2013-01-03  1.307271  0.028474
2013-01-04  0.285534 -0.006510
2013-01-05  0.651992  1.214307
2013-01-06  1.104101 -0.032067

In [43]:
#标签切片
df.loc['2013-01-01':'2013-01-03',['A','B']]

                   A         B
2013-01-01  0.172828  0.169842
2013-01-02 -1.231252 -0.383122
2013-01-03  1.307271  0.028474

In [45]:
#获取与访问标量
df.loc['2013-01-01','A']

0.17282822685112648

In [48]:
df.at[dates[0],'A']#at的参数前面为啥写‘2013-01-01’不行？？？

0.17282822685112648

In [50]:
df.loc['2013-01-01','A']

0.17282822685112648

In [52]:
#通过位置选择df.iloc
#通过传递数值进行位置选择
df.iloc[2,3]

0.5810626309993066

In [55]:
df[2:3]#df[2][3]不可以

                   A         B         C         D
2013-01-03  1.307271  0.028474 -0.700076  0.581063

In [56]:
#通过数值进行切片
df.iloc[3:5,2:4]

                   C         D
2013-01-04  0.140231  0.444879
2013-01-05  0.299408 -0.607426

In [62]:
#制定一个位置的列表
df.iloc[[1,2,4],[2,4]]

                   A         B         C
2013-01-02 -1.231252 -0.383122  1.404800
2013-01-03  1.307271  0.028474 -0.700076
2013-01-05  0.651992  1.214307  0.299408

In [63]:
#对行列进行切片
df.iloc[0:1,2:4]

                   C        D
2013-01-01 -0.139966 -0.75347

In [67]:
#获取特定的值
df.iloc[2,3]

0.5810626309993066

In [68]:
df.iat[2,3]

0.5810626309993066

In [ ]:
#布尔索引

In [69]:
#使用一个单独列的值来选择
df[df.A>0]

                   A         B         C         D
2013-01-01  0.172828  0.169842 -0.139966 -0.753470
2013-01-03  1.307271  0.028474 -0.700076  0.581063
2013-01-04  0.285534 -0.006510  0.140231  0.444879
2013-01-05  0.651992  1.214307  0.299408 -0.607426
2013-01-06  1.104101 -0.032067 -0.880072 -1.396610

In [70]:
#使用where？
df[df>0]

                   A         B         C         D
2013-01-01  0.172828  0.169842       NaN       NaN
2013-01-02       NaN       NaN  1.404800       NaN
2013-01-03  1.307271  0.028474       NaN  0.581063
2013-01-04  0.285534       NaN  0.140231  0.444879
2013-01-05  0.651992  1.214307  0.299408       NaN
2013-01-06  1.104101       NaN       NaN       NaN

In [75]:
#使用isin()方法来过滤
df2=df.copy()
df2['E']=['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.172828  0.169842 -0.139966 -0.753470    one
2013-01-02 -1.231252 -0.383122  1.404800 -0.440605    one
2013-01-03  1.307271  0.028474 -0.700076  0.581063    two
2013-01-04  0.285534 -0.006510  0.140231  0.444879  three
2013-01-05  0.651992  1.214307  0.299408 -0.607426   four
2013-01-06  1.104101 -0.032067 -0.880072 -1.396610  three

In [76]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.307271  0.028474 -0.700076  0.581063   two
2013-01-05  0.651992  1.214307  0.299408 -0.607426  four

In [94]:
#设置
#设置一个新的列
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
df['F']=s1
df

                   A         B         C  D    E    F
2013-01-01  0.000000  0.000000  1.773794  5  NaN  NaN
2013-01-02 -0.103042  0.605576 -1.818530  5  1.0  1.0
2013-01-03 -1.227824  1.207903  0.556289  5  2.0  2.0
2013-01-04 -0.181330  0.592399 -0.175034  5  3.0  3.0
2013-01-05 -0.457267  0.543653 -1.209936  5  4.0  4.0
2013-01-06  0.737691  0.142966 -0.819111  5  5.0  5.0

In [95]:
#通过标签设置新的值
df.at[dates[0],'A']=0
df

                   A         B         C  D    E    F
2013-01-01  0.000000  0.000000  1.773794  5  NaN  NaN
2013-01-02 -0.103042  0.605576 -1.818530  5  1.0  1.0
2013-01-03 -1.227824  1.207903  0.556289  5  2.0  2.0
2013-01-04 -0.181330  0.592399 -0.175034  5  3.0  3.0
2013-01-05 -0.457267  0.543653 -1.209936  5  4.0  4.0
2013-01-06  0.737691  0.142966 -0.819111  5  5.0  5.0

In [96]:
#通过位置设置新的值
df.iat[0,1]=0
df

                   A         B         C  D    E    F
2013-01-01  0.000000  0.000000  1.773794  5  NaN  NaN
2013-01-02 -0.103042  0.605576 -1.818530  5  1.0  1.0
2013-01-03 -1.227824  1.207903  0.556289  5  2.0  2.0
2013-01-04 -0.181330  0.592399 -0.175034  5  3.0  3.0
2013-01-05 -0.457267  0.543653 -1.209936  5  4.0  4.0
2013-01-06  0.737691  0.142966 -0.819111  5  5.0  5.0

In [97]:
#通过一个numpy数组来设置一组新的值
df['D']=np.array([5]*len(df))#df.loc[:,'D']=np.array([5]*len(df))
df

                   A         B         C  D    E    F
2013-01-01  0.000000  0.000000  1.773794  5  NaN  NaN
2013-01-02 -0.103042  0.605576 -1.818530  5  1.0  1.0
2013-01-03 -1.227824  1.207903  0.556289  5  2.0  2.0
2013-01-04 -0.181330  0.592399 -0.175034  5  3.0  3.0
2013-01-05 -0.457267  0.543653 -1.209936  5  4.0  4.0
2013-01-06  0.737691  0.142966 -0.819111  5  5.0  5.0

In [98]:
#通过where来设置一组新的值
df2=df.copy()
df2[df2>0]=-df2
df2

                   A         B         C  D    E    F
2013-01-01  0.000000  0.000000 -1.773794 -5  NaN  NaN
2013-01-02 -0.103042 -0.605576 -1.818530 -5 -1.0 -1.0
2013-01-03 -1.227824 -1.207903 -0.556289 -5 -2.0 -2.0
2013-01-04 -0.181330 -0.592399 -0.175034 -5 -3.0 -3.0
2013-01-05 -0.457267 -0.543653 -1.209936 -5 -4.0 -4.0
2013-01-06 -0.737691 -0.142966 -0.819111 -5 -5.0 -5.0

In [99]:
#四，缺失值处理
#np.nan代替缺失值
#1.reindex()可以对指定轴上的索引进行改变操作，返回原始数据的一个拷贝
df1=df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],'E']=1
df1

                   A         B         C  D    E    F    E
2013-01-01  0.000000  0.000000  1.773794  5  1.0  NaN  1.0
2013-01-02 -0.103042  0.605576 -1.818530  5  1.0  1.0  1.0
2013-01-03 -1.227824  1.207903  0.556289  5  2.0  2.0  2.0
2013-01-04 -0.181330  0.592399 -0.175034  5  3.0  3.0  3.0

In [100]:
#去掉包含缺失值的行
df1.dropna(how='any')

                   A         B         C  D    E    F    E
2013-01-02 -0.103042  0.605576 -1.818530  5  1.0  1.0  1.0
2013-01-03 -1.227824  1.207903  0.556289  5  2.0  2.0  2.0
2013-01-04 -0.181330  0.592399 -0.175034  5  3.0  3.0  3.0

In [101]:
df1

                   A         B         C  D    E    F    E
2013-01-01  0.000000  0.000000  1.773794  5  1.0  NaN  1.0
2013-01-02 -0.103042  0.605576 -1.818530  5  1.0  1.0  1.0
2013-01-03 -1.227824  1.207903  0.556289  5  2.0  2.0  2.0
2013-01-04 -0.181330  0.592399 -0.175034  5  3.0  3.0  3.0

In [105]:
#对缺失值进行补充
df1.fillna(value=5)

                   A         B         C  D    E    F    E
2013-01-01  0.000000  0.000000  1.773794  5  1.0  5.0  1.0
2013-01-02 -0.103042  0.605576 -1.818530  5  1.0  1.0  1.0
2013-01-03 -1.227824  1.207903  0.556289  5  2.0  2.0  2.0
2013-01-04 -0.181330  0.592399 -0.175034  5  3.0  3.0  3.0

In [108]:
#对数据进行布尔填充
df1

                   A         B         C  D    E    F    E
2013-01-01  0.000000  0.000000  1.773794  5  1.0  NaN  1.0
2013-01-02 -0.103042  0.605576 -1.818530  5  1.0  1.0  1.0
2013-01-03 -1.227824  1.207903  0.556289  5  2.0  2.0  2.0
2013-01-04 -0.181330  0.592399 -0.175034  5  3.0  3.0  3.0

In [109]:
pd.isnull(df1)#na值的为true

                A      B      C      D      E      F      E
2013-01-01  False  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False  False
2013-01-04  False  False  False  False  False  False  False

In [ ]:
#五，相关操作
统计（相关操作通常情况下不包括缺失值）

In [119]:
#执行描述性统计，列的平均值
df.mean()

A   -0.205295
B    0.515416
C   -0.282088
D    5.000000
E    3.000000
F    3.000000
dtype: float64

In [122]:
#行的平均值
df.mean(1)

2013-01-01    1.693449
2013-01-02    0.947334
2013-01-03    1.589395
2013-01-04    1.872672
2013-01-05    1.979408
2013-01-06    2.510258
Freq: D, dtype: float64

In [123]:
#对于拥有不同纬度，需要对齐的对象进行操作，pandas会自动沿着指定的维度进行广播：
s=pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)#shift(2) 数据向下移动2位
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [124]:
df.sub(s,axis='index')

                   A         B         C    D    E    F
2013-01-01       NaN       NaN       NaN  NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN  NaN
2013-01-03 -2.227824  0.207903 -0.443711  4.0  1.0  1.0
2013-01-04 -3.181330 -2.407601 -3.175034  2.0  0.0  0.0
2013-01-05 -5.457267 -4.456347 -6.209936  0.0 -1.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN  NaN

In [ ]:
#APPLY

In [127]:
#对数据应用函数
df.apply(lambda x: x-1)

                   A         B         C  D    E    F
2013-01-01 -1.000000 -1.000000  0.773794  4  NaN  NaN
2013-01-02 -1.103042 -0.394424 -2.818530  4  0.0  0.0
2013-01-03 -2.227824  0.207903 -0.443711  4  1.0  1.0
2013-01-04 -1.181330 -0.407601 -1.175034  4  2.0  2.0
2013-01-05 -1.457267 -0.456347 -2.209936  4  3.0  3.0
2013-01-06 -0.262309 -0.857034 -1.819111  4  4.0  4.0

In [ ]:
#直方图

In [ ]:
#字符串方法

In [129]:
s=pd.Series(['A','B','C','Aaba','Baca',np.nan,'CABA','dog','cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [ ]:
#六 合并，符合逻辑关系的操作

In [ ]:
#Concat

In [132]:
df=pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.004966  0.979900 -0.851785  1.807982
1 -0.711749 -0.628650  0.522734 -2.055695
2  0.459558  0.946713 -1.768438 -0.226863
3  0.491482 -1.359121  2.935530  0.008664
4 -0.114536  0.475378  0.989679  0.597540
5 -1.009665 -0.395799  1.052478  0.528947
6 -0.212005 -0.600309 -1.303872 -1.874309
7  0.634107 -0.574418 -0.371240  1.310625
8 -0.136507  0.193289  1.529066  0.315547
9 -0.323248  0.910249 -2.261206  0.327629

In [133]:
#break it into pieces
pieces=[df[:3],df[3:7],df[7:1]]
dfpc=pd.concat(pieces)
dfpc

          0         1         2         3
0  0.004966  0.979900 -0.851785  1.807982
1 -0.711749 -0.628650  0.522734 -2.055695
2  0.459558  0.946713 -1.768438 -0.226863
3  0.491482 -1.359121  2.935530  0.008664
4 -0.114536  0.475378  0.989679  0.597540
5 -1.009665 -0.395799  1.052478  0.528947
6 -0.212005 -0.600309 -1.303872 -1.874309

In [ ]:
#Join 类似于SQL类型的合并

In [145]:
left=pd.DataFrame({'key':['foo','foo'],'lval':[1,2]})
right=pd.DataFrame({'key':['foo','foo'],'rval':[4,5]})
left

   key  lval
0  foo     1
1  foo     2

In [146]:
right

   key  rval
0  foo     4
1  foo     5

In [150]:
lr=pd.merge(left,right,on='key')

In [ ]:
#将一行连接到一个DataFrame上

In [149]:
s=right.iloc[1]
s

key     foo
rval      5
Name: 1, dtype: object

In [154]:
lr.append(s,ignore_index=True)#注意index的名字

   key  lval  rval
0  foo   1.0     4
1  foo   1.0     5
2  foo   2.0     4
3  foo   2.0     5
4  foo   NaN     5

In [ ]:
七 分组
八 重塑
九 时间序列
十 Categorical
十一 画图
十二 导入和保存数据